FemDesign.Bars.Buckling.BucklingType
Buckling types

FemDesign.Bars.Buckling.BucklingType.FlexuralWeak


FemDesign.Bars.Buckling.BucklingType.FlexuralStiff


FemDesign.Bars.Buckling.BucklingType.PressuredTopFlange
Only for steel bars. It is the top flange from FEM-Design 18

FemDesign.Bars.Buckling.BucklingType.LateralTorsional
Only for timber bars

FemDesign.Bars.Buckling.BucklingType.PressuredBottomFlange
From FD18; only for steel bars